Revit 2026 API

# FamilySymbolSetThermalProperties Method

---

Sets the thermal properties for the given FamilySymbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetThermalProperties(
	FamilyThermalProperties thermalProperties
)
```
```vb
Public Sub SetThermalProperties (
	thermalProperties As FamilyThermalProperties
)
```
```cpp
public:
void SetThermalProperties(
	FamilyThermalProperties^ thermalProperties
)
```
```fsharp
member SetThermalProperties :
        thermalProperties : FamilyThermalProperties -> unit
```

#### Parameters

thermalProperties FamilyThermalProperties
     The new thermal properties. If , this unsets custom thermal properties for this FamilySymbol.

| Exception | Condition |
| --- | --- |
| ArgumentException | The thermal properties are not valid for assignment. |
| InvalidOperationException | This FamilySymbol does not contain thermal properties. |

#### Reference

FamilySymbol Class

Autodesk.Revit.DB Namespace